(function (_0x16c1a0, _0x3263ca) {
  const _0x2bccfc = _0x16c1a0();
  while (!![]) {
      try {
          const _0x392e3d = parseInt(_0x2d32(0x1af)) / 0x1 + parseInt(_0x2d32(0x1c2)) / 0x2 * (-parseInt(_0x2d32(0x1b6)) / 0x3) + -parseInt(_0x2d32(0x1b1)) / 0x4 * (parseInt(_0x2d32(0x19a)) / 0x5) + -parseInt(_0x2d32(0x19c)) / 0x6 * (-parseInt(_0x2d32(0x1a6)) / 0x7) + parseInt(_0x2d32(0x19e)) / 0x8 + -parseInt(_0x2d32(0x1b5)) / 0x9 + parseInt(_0x2d32(0x1a0)) / 0xa;
          if (_0x392e3d === _0x3263ca) {
              break;
          } else {
              _0x2bccfc['push'](_0x2bccfc['shift']());
          }
      } catch (_0x1eac72) {
          _0x2bccfc['push'](_0x2bccfc['shift']());
      }
  }
}(_0x4fba, 0x2cf38));
import _0x485bd7 from 'node-fetch';

function _0x2d32(_0x4e1a61, _0x23c84f) {
  const _0x4fbad0 = _0x4fba();
  _0x2d32 = function (_0x2d3214, _0x21255f) {
      _0x2d3214 = _0x2d3214 - 0x19a;
      let _0x7b6250 = _0x4fbad0[_0x2d3214];
      return _0x7b6250;
  };
  return _0x2d32(_0x4e1a61, _0x23c84f);
}

function _0x4fba() {
  const _0x3d7d44 = [
      'matchAll',
      'reply',
      'profilePictureUrl',
      'trim',
      '271970bQXHHX',
      'BEGIN:VCARD\x0aVERSION:3.0\x0aN:XL;',
      'sendMessage',
      'users',
      '85xrPAFM',
      'vvvvvviv',
      '510tVIDeD',
      '乂 💖 𝐀𝐍𝐆𝐄𝐋𝐎 🧿 𝐈𝐍𝐍𝐎𝐂𝐄𝐍𝐓 ⛰️乂',
      '1265544uWoUbQ',
      'sender',
      '749970RFZgOq',
      'status@broadcast',
      'vvvvvivv',
      'getRandom',
      'tags',
      'https://telegra.ph/file/278d4552ebe00f5d279b5.jpg',
      '30149jngiPi',
      'buffer',
      'chat',
      'gp1',
      '@s.whatsapp.net',
      'numeric',
      'toLocaleDateString',
      'long',
      'map',
      '140985uONfPg',
      '0@s.whatsapp.net',
      '44372ttjNuD',
      'user',
      'split',
      'اوامــر الـبـنـك ⛰️!',
      '2084256uAFywm',
      '3wEiBEh',
      'يـتـم تـجـهيـز الـقـائـمـه⏳*',
      '\x0aitem1.X-ABLabell:Ponsel\x0aEND:VCARD',
      'catch',
      'data',
      'command',
      ',\x0aitem1.TEL;waid=',
      'bienvenido'
  ];
  _0x4fba = function () {
      return _0x3d7d44;
  };
  return _0x4fba();
}
const handler = async (_0x36c8e3, {
  conn: _0xe9b4f0,
  usedPrefix: _0x31b114,
  usedPrefix: _0x3233b5,
  __dirname: _0x23e7bd,
  text: _0x131b6f,
  isPrems: _0x25c1b0
}) => {
  try {
      if (_0x31b114 == 'a' || _0x31b114 == 'A')
          return;
      const _0x806279 = d[_0x2d32(0x1ac)](locale, {
          'day': _0x2d32(0x1ab),
          'month': _0x2d32(0x1ad),
          'year': _0x2d32(0x1ab)
      });
      const {
          money: _0x4f08e8,
          joincount: _0x2db758
      } = global['db'][_0x2d32(0x1ba)][_0x2d32(0x1c5)][_0x36c8e3[_0x2d32(0x19f)]];
      const {
          exp: _0x2ecce8,
          limit: _0x2ecd16,
          level: _0xebe489,
          role: _0x1861d8
      } = global['db']['data'][_0x2d32(0x1c5)][_0x36c8e3['sender']];
      const _0x36b56d = await _0xe9b4f0[_0x2d32(0x1c0)](_0xe9b4f0[_0x2d32(0x1b2)]['jid'])[_0x2d32(0x1b9)](_0x100641 => _0x2d32(0x1a5));
      const _0x4b14f5 = {
          'key': {
              'fromMe': ![],
              'participant': _0x2d32(0x1b0),
              ..._0x36c8e3[_0x2d32(0x1a8)] ? {
                  'remoteJid': _0x2d32(0x1a1)
              } : {}
          },
          'message': {
              'contactMessage': {
                  'displayName': wm,
                  'vcard': _0x2d32(0x1c3) + wm + ',;;;\x0aFN:' + wm + _0x2d32(0x1bc) + _0x36c8e3[_0x2d32(0x19f)][_0x2d32(0x1b3)]('@')[0x0] + ':' + _0x36c8e3['sender']['split']('@')[0x0] + _0x2d32(0x1b8),
                  'jpegThumbnail': imagen1,
                  'thumbnail': imagen1,
                  'sendEphemeral': !![]
              }
          }
      };
      await _0xe9b4f0[_0x2d32(0x1bf)](_0x36c8e3[_0x2d32(0x1a8)], _0x2d32(0x1b7), _0x36c8e3, {
          'contextInfo': {
              'forwardingScore': 0x7e6,
              'isForwarded': !![],
              'externalAdReply': {
                  'title': _0x2d32(0x1b4),
                  'body': _0x2d32(0x1bd),
                  'sourceUrl': global['md'],
                  'thumbnail': await (await _0x485bd7(_0x36b56d))[_0x2d32(0x1a7)]()
              }
          }
      });
      await _0xe9b4f0[_0x2d32(0x1c4)](_0x36c8e3[_0x2d32(0x1a8)], {
          'react': {
              'text': '💎',
              'key': _0x36c8e3['key']
          }
      });
      let _0x41f12f = '⦓           ⦓🍀⦔          ⦔ـ\x0a⌟🍄⌜❥ قـائـمـة الـبـنـك ❥⌟🍄⌜\x0a⦓           ⦓🍀⦔          ⦔ـ\x0a© الاوامــر ⁦(⁠ ⁠ꈍ⁠ᴗ⁠ꈍ⁠)⁩\x0a⦓           ⦓🍀⦔          ⦔ـ\x0a🧰❯ ⏐ .عـمـلات \x0a◈᚜لـتـجـمـع عـمـلات᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .راتـب \x0a◈᚜بيعطيك راتب يومي᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .يـومـي\x0a◈᚜بيعطيك هديتك اليوميه᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .كـويـنـز\x0a◈᚜هـديـه للـغـامـرة᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .عـمـلاتـي \x0a◈᚜قائمة عملاتك᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .لـفـل\x0a◈᚜لمعرفة لفلك᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .مـتـجـر \x0a◈᚜بيعطيك قائمة المتجر᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .اصـتـيـاد\x0a◈᚜للذهاب الي مغامره᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .صـحـه | الـصـحـه\x0a◈᚜ بيوريك دمك في المغامره᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .عـمـل\x0a◈᚜لتجميع هدية من الاعمل᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .تـفـعـيـل\x0a◈᚜لتسجيل ف البوت᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .الـغـاء-الـتـفـعـيـل\x0a◈᚜لالغاء التسجيل ف البوت᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .شـراء \x0a◈᚜لشراء عملات في البوت᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .نـقـل \x0a◈᚜لتصغير حجم الصور ᚛◈\x0a⦓                 ⦔ـ\x0a🧰❯ ⏐ .سـرقـه \x0a◈᚜لسرقة طاقه من الاعضاء᚛◈\x0a⦓           ⦓🍀⦔          ⦔ـ\x0aبـس كـده ⁦(⁠≧⁠▽⁠≦⁠)⁩\x0a⦓           ⦓🍀⦔          ⦔ـ\x0a✒️⏐𝑴𝑨𝑹𝑺 https://chat.whatsapp.com/HzfsFIfYTj7HdjbekZPfIT\x0a⦓           ⦓🍀⦔          ⦔';
      await _0xe9b4f0[_0x2d32(0x1c4)](_0x36c8e3['chat'], {
          'text': _0x41f12f[_0x2d32(0x1c1)](),
          'mentions': [..._0x41f12f[_0x2d32(0x1be)](/@([0-9]{5,16}|0)/g)][_0x2d32(0x1ae)](_0x24b472 => _0x24b472[0x1] + _0x2d32(0x1aa)),
          'contextInfo': {
              'forwardingScore': 0x98967f,
              'isForwarded': !![],
              'mentionedJid': [..._0x41f12f[_0x2d32(0x1be)](/@([0-9]{5,16}|0)/g)]['map'](_0xf21fb3 => _0xf21fb3[0x1] + _0x2d32(0x1aa)),
              'externalAdReply': {
                  'showAdAttribution': !![],
                  'containsAutoReply': !![],
                  'renderLargerThumbnail': !![],
                  'title': _0x2d32(0x19d),
                  'containsAutoReply': !![],
                  'mediaType': 0x1,
                  'thumbnail': [
                      imagen6,
                      imagen1,
                      imagen4
                  ][_0x2d32(0x1a3)](),
                  'mediaUrl': global[_0x2d32(0x1a9)],
                  'sourceUrl': global['gp1']
              }
          }
      }, {
          'quoted': _0x4b14f5
      });
  } catch {
      _0xe9b4f0[_0x2d32(0x1bf)](_0x36c8e3['chat'], '*❗ حـدث خـطـاء*', _0x36c8e3);
  }
};
handler['help'] = [_0x2d32(0x1a2)];
handler[_0x2d32(0x1a4)] = [_0x2d32(0x19b)];
handler[_0x2d32(0x1bb)] = /^(م12)$/i;
export default handler;