let handler = async (m, { command, text }) => m.reply(`*استمارة 📜 دخول 𝐌𝐀𝐑𝐒 🌑*
⧠━─━⧈⇓《🌑》⇓⧈━─━⧠
*〖 🔮في وسط غيوم السماء، وبين خيوط أشعة الشمس، وبين أغصان الأزهار وأوراق الأشجار، نحيي ضويفنا الكرام🔮〗* 
⧠━─━⧈⇓《🌑》⇓⧈━─━⧠

*❐ اللــ🌑ــقـب :  ⊑ ⊒*

*❐ الإنـــــم🔮ـي : ⊑ ⊒*

*❐ ذكـر/انثـى :  ⊑ ⊒*

*❐ مـن طـ🎯ـرف ؟ : ⊑ ⊒*

*❰ ⚠️ مـلاحـظــات⚠️  ❱*

*✺ إرسال صورة للشخصية يلي بدك لقبها.*
*✺ ⚠️النقابة مختلطة.⚠️*
⧠━─━⧈⇓《🌑》⇓⧈━─━⧠
*❈↲لملئ الإستمارة يرجى النسخ وملء الفراغات*
*❈↲بعد ملئ الاستمارة منشن احد المشرفين*
*❈↲يرجى ارفاق صورة للقب*
*✦━━━━━[ 𝐌𝐀𝐑𝐒 ]━━━━━✦*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(الاستماره|55|استماره\استمارة)$/i

export default handler