let handler = async (m, { command, text }) => m.reply(`*◞◈ مـمـلـكـة ڤـالـيـريـا الـعـظـمى 🐦‍🔥⛩️◜
✽ ━────━ ⊰🐦‍🔥⊱ ━────━ ✽

        ❖┆اسـتـقـبـال ڤـالـيـريـا🐦‍🔥┆❖

⎔ الـلـقـب┆🏷️
•‏ إسم الشخصية ومن أي عمل
⎔ الـجـنـس┆🚻
* ذكر أم أنثى
⎔ صـورة لـ الـلـقـب┆📜
* يرجى وضع صورة واضحة وجميلة
✠‏ ━── ─ •⛩️• ─ ──━ ✠
⟐ نـقـابـات ڤـالـيـريـا╎🐦‍🔥◟

⎔ سـبـارتـا┆⚔️
⎔ سـتـار┆⭐
⎔ فـايـتـون┆♟️
⎔ وافـيـس┆🌊
⎔ بـلـود┆♦️
⎔ مـارس┆🌑
⎔ آسـورا┆🕊️
⎔ رايـن┆❄️
⎔ إيـنـوتـشـي┆🎐
⎔ مـلـاحـظـة┆⚠️
•‏ يـرجى اخـتيـار نـقابـة واحـدة فقط .
* نـقـابـة "فـايـتـون♟️" لـلـذكـور فـقـط .‼️
* نـقـابـة "إيـنـوتـشـي🎐" لـلـبـنـات فـقـط .‼️
✽ ━────━ ⊰🐦‍🔥⊱ ━────━ ✽
◞◈ ڤـالـيـريـا الـعـظـمـى┆ヴァ🐦‍🔥⛩️◜`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(الاستماره|11|استماره\استمارة)$/i

export default handler